### Terragrunt Plan :memo:

```text
time=2024-08-10T16:09:33Z level=info msg=The stack at terraform will be processed in the following order for command plan:
Group 1
- Module /home/runner/work/homelab/homelab/terraform/aliyun


Acquiring state lock. This may take a few moments...
module.nixos_hgh2.data.external.build: Reading...
module.nixos_hgh0.data.external.build: Reading...
module.nixos_sin0.data.external.build: Reading...
module.nixos_hgh1.data.external.build: Reading...
module.nixos_sin0.data.external.keyscan: Reading...
module.nixos_sin0.data.external.keyscan: Read complete after 2s [id=-]
module.nixos_hgh2.data.external.build: Still reading... [10s elapsed]
module.nixos_hgh1.data.external.build: Still reading... [10s elapsed]
module.nixos_hgh0.data.external.build: Still reading... [10s elapsed]
module.nixos_sin0.data.external.build: Still reading... [10s elapsed]
module.nixos_hgh0.data.external.keyscan: Reading...
module.nixos_hgh1.data.external.keyscan: Reading...
module.nixos_hgh2.data.external.keyscan: Reading...
module.nixos_hgh0.data.external.keyscan: Read complete after 3s [id=-]
module.nixos_hgh1.data.external.keyscan: Read complete after 3s [id=-]
module.nixos_hgh2.data.external.keyscan: Read complete after 3s [id=-]
module.nixos_sin0.data.external.build: Read complete after 20s [id=-]
module.nixos_hgh0.data.external.build: Read complete after 20s [id=-]
module.nixos_hgh1.data.external.build: Read complete after 20s [id=-]
module.nixos_hgh2.data.external.build: Read complete after 20s [id=-]

Note: Objects have changed outside of OpenTofu

OpenTofu detected the following changes made outside of OpenTofu since the
last "tofu apply" which may have affected this plan:

  # alicloud_nat_gateway.hgh has been deleted
  - resource "alicloud_nat_gateway" "hgh" {
      - id                   = "ngw-bp1pfic2owdgnsw7zz6qc" -> null
        name                 = "hgh-nat"
        tags                 = {}
        # (13 unchanged attributes hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

OpenTofu used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
-/+ destroy and then create replacement

OpenTofu will perform the following actions:

  # alicloud_nat_gateway.hgh will be created
  + resource "alicloud_nat_gateway" "hgh" {
      + bandwidth_package_ids = (known after apply)
      + deletion_protection   = (known after apply)
      + eip_bind_mode         = (known after apply)
      + forward_table_ids     = (known after apply)
      + id                    = (known after apply)
      + instance_charge_type  = (known after apply)
      + internet_charge_type  = (known after apply)
      + name                  = (known after apply)
      + nat_gateway_name      = "hgh-nat"
      + nat_type              = (known after apply)
      + network_type          = (known after apply)
      + payment_type          = (known after apply)
      + snat_table_ids        = (known after apply)
      + specification         = (known after apply)
      + status                = (known after apply)
      + vpc_id                = "vpc-bp1uxe2x9piyejy6r5x4s"
    }

  # alicloud_route_entry.hgh will be created
  + resource "alicloud_route_entry" "hgh" {
      + destination_cidrblock = "0.0.0.0/0"
      + id                    = (known after apply)
      + nexthop_id            = (known after apply)
      + nexthop_type          = "NatGateway"
      + route_table_id        = "vtb-bp1bflyq5absoxddf04jj"
      + router_id             = (known after apply)
    }

  # module.nixos_hgh0.null_resource.deploy[0] must be replaced
-/+ resource "null_resource" "deploy" {
      ~ id       = "6612063193388942443" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "build"       = "/nix/store/8jy1615iraryw94zpqm4jnirgd3dhmx6-nixos-system-hgh0-24.11.20240804.cb9a96f" -> "/nix/store/qwwyiczcikil0wws76crnlzz6r58s747-nixos-system-hgh0-24.11.20240809.5e0ca22"
            # (1 unchanged element hidden)
        }
    }

  # module.nixos_hgh1.null_resource.deploy[0] must be replaced
-/+ resource "null_resource" "deploy" {
      ~ id       = "6605158446302321431" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "build"       = "/nix/store/4lhm9z7i3lg030x0y8zaidhd0ymn3pwa-nixos-system-hgh1-24.11.20240804.cb9a96f" -> "/nix/store/x362hdrllyaqpkz2fnk1738m1bivwkrc-nixos-system-hgh1-24.11.20240809.5e0ca22"
            # (1 unchanged element hidden)
        }
    }

  # module.nixos_hgh2.null_resource.deploy[0] must be replaced
-/+ resource "null_resource" "deploy" {
      ~ id       = "8830127025667501189" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "build"       = "/nix/store/gyidj2hhyjyrsym1vy5rgpbdj83qv1am-nixos-system-hgh2-24.11.20240804.cb9a96f" -> "/nix/store/2m8wx7jmdqvyvk1plljvap31mvh83qjh-nixos-system-hgh2-24.11.20240809.5e0ca22"
            # (1 unchanged element hidden)
        }
    }

  # module.nixos_sin0.null_resource.deploy[0] must be replaced
-/+ resource "null_resource" "deploy" {
      ~ id       = "8175677528622509163" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "build"       = "/nix/store/58p5f87jdaafpqgd4p0iyihaaqk9537r-nixos-system-sin0-24.11.20240804.cb9a96f" -> "/nix/store/4nfq8cyi4vj71az1n5vw4xv7l516qyzm-nixos-system-sin0-24.11.20240809.5e0ca22"
            # (1 unchanged element hidden)
        }
    }

Plan: 6 to add, 0 to change, 4 to destroy.
```

**Status**: out of sync :warning: